Repository: mjlassila/plugin-DerivativeImages
Catalog: languages/*.po
Languages: fi_fi

source: Processing files. This may take a while. You may continue administering your site.
fi_fi: Käsitellään tiedostoja. Voit jatkaa samaan aikaan sivuston muita ylläpitotöitä.

source: The ImageMagick directory path is missing.
fi_fi: ImageMagick-asennushakemiston polku puuttuu.

source: Derivative Images
fi_fi: Esikatselukuvat

source: Omeka attempts to create fullsize, thumbnail, and square thumbnail derivative images when a file is added. This plugin recreates (or creates) derivative images according to the size constraints set in the %sAppearance settings%s. This plugin is useful if image sizes must change for a new theme, after upgrading from an earlier version of Omeka, or after your server's %sImageMagick%s software has been upgraded.
fi_fi: Aineistoja lisättäessä Omeka luo esikatselukuvat kuvista ja PDF-tiedostoista. Tarvittaessa esikatselukuvat voi luoda uudelleen, esimerkiksi jos kuvien mittasuhteita %sUlkoasuasetuksissa%s on muutettu tai palvelimen %sImageMagick%s -sovelluksen päivityksen jälkeen.

source: Please note that Omeka is unable to create derivative images for some files. We highly recommend that you back up Omeka's files directory before running this process.
fi_fi: Omeka voi luoda esikatselukuvat vain tuettua muotoa oleviin tiedostoihin. Näitä ovat useimmat kuvatiedostotyypit, sekä tavallisimmat PDF-tiedostomuodot. Omekan files-hakemiston varmuuskopiointi on suositeltavaa ennen esikatselukuvien uudelleenluomista.

source: Process type
fi_fi: Käsiteltävät tiedostot

source: Select files for creating new derivative images.
fi_fi: Valitse tiedostot joille esikatselukuvat luodaan

source: All files
fi_fi: Kaikki tiedostot

source: Files that have derivative images
fi_fi: Kaikki tiedostot joilla on nykyinen esikatselukuva

source: Files that do not have derivative images
fi_fi: Tiedostot joihin ei ole esikatselukuvia

source: Image sizes
fi_fi: Kuvakoot

source: Select which image sizes you want to create. Checking none will create all image sizes. (Sizes listed here are set in the %sAppearance settings%s.)
fi_fi: Valitse esikatselukuvien kuvakoot. Ilman valintaa luodaan kaikki koot. (Kuvakoot määritetään %sUlkoasuasetuksissa%s.)

source: Fullsize
fi_fi: Täysi koko

source: pixels
fi_fi: pikseliä

source: Thumbnail
fi_fi: Esikatselukuva

source: Square thumbnail
fi_fi: Neliöity esikatselukuva

source: MIME types
fi_fi: MIME-tyypit

source: Select which file MIME types you want to process. Checking none will process all MIME types. (This list represents every MIME type currently available in this Omeka site.)
fi_fi: Valitse mitä tiedostomuotoja käsitellään. Ilman valintaa käsitellään kaikki tiedostomuodot. Lista sisältää kaikki tällä hetkellä käytössä olevat tiedostomuodot.

source: Process Files
fi_fi: Käsittele tiedostot
